In [1]:
import pandas as pd

In [3]:
CAvideos = pd.read_csv('CAvideos.csv')
GBvideos = pd.read_csv('GBvideos.csv')

In [5]:
CAvideos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40881 entries, 0 to 40880
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                40881 non-null  object
 1   trending_date           40881 non-null  object
 2   title                   40881 non-null  object
 3   channel_title           40881 non-null  object
 4   category_id             40881 non-null  int64
 5   publish_time            40881 non-null  object
 6   tags                    40881 non-null  object
 7   views                   40881 non-null  int64
 8   likes                   40881 non-null  int64
 9   dislikes                40881 non-null  int64
 10  comment_count           40881 non-null  int64
 11  thumbnail_link          40881 non-null  object
 12  comments_disabled       40881 non-null  bool
 13  ratings_disabled        40881 non-null  bool
 14  video_error_or_removed  40881 non-null  bool
 15  description             39585 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 4.2+ MB

In [6]:
GBvideos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38916 entries, 0 to 38915
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                38916 non-null  object
 1   trending_date           38916 non-null  object
 2   title                   38916 non-null  object
 3   channel_title           38916 non-null  object
 4   category_id             38916 non-null  int64
 5   publish_time            38916 non-null  object
 6   tags                    38916 non-null  object
 7   views                   38916 non-null  int64
 8   likes                   38916 non-null  int64
 9   dislikes                38916 non-null  int64
 10  comment_count           38916 non-null  int64
 11  thumbnail_link          38916 non-null  object
 12  comments_disabled       38916 non-null  bool
 13  ratings_disabled        38916 non-null  bool
 14  video_error_or_removed  38916 non-null  bool
 15  description             38304 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 4.0+ MB

# 3 Ways to combine 2 datasets.s
## Join
## Concat
## Merge

In [9]:
# Join --  Suffix defined so unique headers but (32 columns - tables side by side)
dfjoin = CAvideos.join(GBvideos, lsuffix = '_CA', rsuffix = '_GB')
dfjoin.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40881 entries, 0 to 40880
Data columns (total 32 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   video_id_CA                40881 non-null  object
 1   trending_date_CA           40881 non-null  object
 2   title_CA                   40881 non-null  object
 3   channel_title_CA           40881 non-null  object
 4   category_id_CA             40881 non-null  int64
 5   publish_time_CA            40881 non-null  object
 6   tags_CA                    40881 non-null  object
 7   views_CA                   40881 non-null  int64
 8   likes_CA                   40881 non-null  int64
 9   dislikes_CA                40881 non-null  int64
 10  comment_count_CA           40881 non-null  int64
 11  thumbnail_link_CA          40881 non-null  object
 12  comments_disabled_CA       40881 non-null  bool
 13  ratings_disabled_CA        40881 non-null  bool
 14  video_error_or_removed_CA  40881 non-null  bool
 15  description_CA             39585 non-null  object
 16  video_id_GB                38916 non-null  object
 17  trending_date_GB           38916 non-null  object
 18  title_GB                   38916 non-null  object
 19  channel_title_GB           38916 non-null  object
 20  category_id_GB             38916 non-null  float64
 21  publish_time_GB            38916 non-null  object
 22  tags_GB                    38916 non-null  object
 23  views_GB                   38916 non-null  float64
 24  likes_GB                   38916 non-null  float64
 25  dislikes_GB                38916 non-null  float64
 26  comment_count_GB           38916 non-null  float64
 27  thumbnail_link_GB          38916 non-null  object
 28  comments_disabled_GB       38916 non-null  object
 29  ratings_disabled_GB        38916 non-null  object
 30  video_error_or_removed_GB  38916 non-null  object
 31  description_GB             38304 non-null  object
dtypes: bool(3), float64(5), int64(5), object(19)
memory usage: 9.2+ MB

In [8]:
# Concat - Merges based on rows.

dfconcat = pd.concat([CAvideos, GBvideos])
dfconcat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 79797 entries, 0 to 38915
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                79797 non-null  object
 1   trending_date           79797 non-null  object
 2   title                   79797 non-null  object
 3   channel_title           79797 non-null  object
 4   category_id             79797 non-null  int64
 5   publish_time            79797 non-null  object
 6   tags                    79797 non-null  object
 7   views                   79797 non-null  int64
 8   likes                   79797 non-null  int64
 9   dislikes                79797 non-null  int64
 10  comment_count           79797 non-null  int64
 11  thumbnail_link          79797 non-null  object
 12  comments_disabled       79797 non-null  bool
 13  ratings_disabled        79797 non-null  bool
 14  video_error_or_removed  79797 non-null  bool
 15  description             77889 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 8.8+ MB

In [10]:
staff  = pd.DataFrame({"Staff": ['Mary', 'John', 'Jack', 'Sally','Mark', 'Jane'],
                    "City": ['Dublin', 'Berlin', 'Warsaw', 'Paris','Dublin', 'Lisbon']})
staff

   Staff    City
0   Mary  Dublin
1   John  Berlin
2   Jack  Warsaw
3  Sally   Paris
4   Mark  Dublin
5   Jane  Lisbon

In [11]:
salaries = pd.DataFrame({'City': ['Paris','Warsaw','Berlin','Dublin', 'London'],
                        'Avg Salary':[58000, 45000, 55000, 60000, 62000]})
salaries

     City  Avg Salary
0   Paris       58000
1  Warsaw       45000
2  Berlin       55000
3  Dublin       60000
4  London       62000

In [12]:
# Inner Join - Missing staff that didnt have a country of salary.

staff.merge(salaries)

   Staff    City  Avg Salary
0   Mary  Dublin       60000
1   Mark  Dublin       60000
2   John  Berlin       55000
3   Jack  Warsaw       45000
4  Sally   Paris       58000